wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl876x_gdma_def.h
/**
*********************************************************************************************************
*               Copyright(c) 2024, Realtek Semiconductor Corporation. All rights reserved.
*********************************************************************************************************
* @file      rtl876x_gdma_def.h
* @brief     GDMA Structures Section
* @details
* @author    colin
* @date      2024-06-07
* @version   v1.0
* *********************************************************************************************************
*/

#ifndef RTL_GDMA_DEF_H
#define RTL_GDMA_DEF_H

#ifdef  __cplusplus
extern "C" {
#endif /* __cplusplus */

#include <stdint.h>
#include <stdbool.h>
#include "rtl876x.h"

#define CHIP_GDMA_CHANNEL_NUM                        (16)

#define GDMA_SUPPORT_GATHER_SCATTER_FUNCTION         (1)
#define GDMA_SUPPORT_INT_HAIF_BLOCK                  (1)
#define GDMA_SUPPORT_INT_HAIF_BLOCK_ALL              (1)
#define GDMA_SUPPORT_TIMER_DMA_EN                    (1)

/*============================================================================*
 *                         GDMA Registers Memory Map
 *============================================================================*/
typedef struct
{
    __IO uint32_t GDMA_SARx;                /*!< 0x00 */
    __I  uint32_t GDMA_CURR_SARx;           /*!< 0x04 */
    __IO uint32_t GDMA_DARx;                /*!< 0x08 */
    __I  uint32_t GDMA_CURR_DARx;           /*!< 0x0C */
    __IO uint32_t GDMA_LLPx;                /*!< 0x10 */
    __IO uint32_t GDMA_RSVD;                /*!< 0x14 */
    __IO uint32_t GDMA_CTL_LOWx;            /*!< 0x18 */
    __IO uint32_t GDMA_CTL_HIGHx;           /*!< 0x1C */
    __IO uint32_t GDMA_RSVD1[8];            /*!< 0x20 ~ 0x3C */
    __IO uint32_t GDMA_CFG_LOWx;            /*!< 0x40 */
    __IO uint32_t GDMA_CFG_HIGHx;           /*!< 0x44 */
    __IO uint32_t GDMA_SGR_LOW;             /*!< 0x48 */
    __IO uint32_t GDMA_SGR_HIGH;            /*!< 0x4C */
    __IO uint32_t GDMA_DSR_LOW;             /*!< 0x50 */
    __IO uint32_t GDMA_DSR_HIGH;            /*!< 0x54 */
} GDMA_ChannelTypeDef;

typedef struct
{
    uint32_t GDMA_RSVD[10];                 /*!< 0x2C0 - 0x2E4 */

    __I uint32_t GDMA_StatusTfr;            /*!< 0x2E8 */
    uint32_t GDMA_RSVD1;
    __I uint32_t GDMA_StatusBlock;          /*!< 0x2F0 */
    __I uint32_t GDMA_StatusHalfBlock;      /*!< 0x2F4 */
    __I uint32_t GDMA_StatusSrcTran;        /*!< 0x2F8 */
    uint32_t GDMA_RSVD3;
    __I uint32_t GDMA_StatusDstTran;        /*!< 0x300 */
    uint32_t GDMA_RSVD4;
    __I uint32_t GDMA_StatuErr;             /*!< 0x308 */
    __I uint32_t GDMA_StatuErrNonSecure;

    __IO uint32_t GDMA_MaskTfr;             /*!< 0x310 */
    uint32_t GDMA_RSVD6;
    __IO uint32_t GDMA_MaskBlock;           /*!< 0x318 */
    __IO uint32_t GDMA_MaskHalfBlock;       /*!< 0x31C */
    __IO uint32_t GDMA_MaskSrcTran;         /*!< 0x320 */
    uint32_t GDMA_RSVD8;
    __IO uint32_t GDMA_MaskDstTran;         /*!< 0x328 */
    uint32_t GDMA_RSVD9;
    __IO uint32_t GDMA_MaskErr;             /*!< 0x330 */
    __IO uint32_t GDMA_MaskErrNonSecure;

    __O uint32_t GDMA_ClearTfr;             /*!< 0x338 */
    uint32_t GDMA_RSVD11;
    __O uint32_t GDMA_ClearBlock;           /*!< 0x340 */
    __O uint32_t GDMA_ClearHalfBlock;       /*!< 0x344 */
    __O uint32_t GDMA_ClearSrcTran;         /*!< 0x348 */
    uint32_t GDMA_RSVD13;
    __O uint32_t GDMA_ClearDstTran;         /*!< 0x350 */
    uint32_t GDMA_RSVD14;
    __O uint32_t GDMA_ClearErr;             /*!< 0x358 */
    __O uint32_t GDMA_ClearErrNonSecure;

    uint32_t GDMA_RSVD16[14];               /*!< 0x360 ~ 0x394 */

    __IO uint32_t GDMA_DmaCfgReg;           /*!< 0x398 */
    uint32_t GDMA_RSVD17;
    __IO uint32_t GDMA_ChEnReg;             /*!< 0x3A0 */
    uint32_t GDMA_RSVD18;

    uint32_t GDMA_RSVD19[4];                /*!< 0x3A8 ~ 0x3B4 */
    __IO uint32_t GDMA_DmaOsNum;            /*!< 0x3B8 */
    uint32_t GDMA_RSVD20;
} GDMA_TypeDef;

/* ================================================================================ */
/* ================                GDMA Declaration                ================ */
/* ================================================================================ */
#define GDMA_REG_BASE                   (RXI350_DMA_CFG_BASE + 0x02c0)
#define GDMA_Channel0_BASE              (RXI350_DMA_CFG_BASE + 0x0000)
#define GDMA_Channel1_BASE              (RXI350_DMA_CFG_BASE + 0x0058)
#define GDMA_Channel2_BASE              (RXI350_DMA_CFG_BASE + 0x00b0)
#define GDMA_Channel3_BASE              (RXI350_DMA_CFG_BASE + 0x0108)
#define GDMA_Channel4_BASE              (RXI350_DMA_CFG_BASE + 0x0160)
#define GDMA_Channel5_BASE              (RXI350_DMA_CFG_BASE + 0x01b8)
#define GDMA_Channel6_BASE              (RXI350_DMA_CFG_BASE + 0x0210)
#define GDMA_Channel7_BASE              (RXI350_DMA_CFG_BASE + 0x0268)
#define GDMA_Channel8_BASE              (RXI350_DMA_CFG_BASE + 0x0400)
#define GDMA_Channel9_BASE              (RXI350_DMA_CFG_BASE + 0x0458)
#define GDMA_Channel10_BASE             (RXI350_DMA_CFG_BASE + 0x04b0)
#define GDMA_Channel11_BASE             (RXI350_DMA_CFG_BASE + 0x0508)
#define GDMA_Channel12_BASE             (RXI350_DMA_CFG_BASE + 0x0560)
#define GDMA_Channel13_BASE             (RXI350_DMA_CFG_BASE + 0x05B8)
#define GDMA_Channel14_BASE             (RXI350_DMA_CFG_BASE + 0x0610)
#define GDMA_Channel15_BASE             (RXI350_DMA_CFG_BASE + 0x0668)

#define GDMA0                           ((GDMA_TypeDef             *) GDMA_REG_BASE)
#define GDMA_BASE                       ((GDMA_TypeDef             *) GDMA_REG_BASE)
#define GDMA_Channel0                   ((GDMA_ChannelTypeDef      *) GDMA_Channel0_BASE)
#define GDMA_Channel1                   ((GDMA_ChannelTypeDef      *) GDMA_Channel1_BASE)
#define GDMA_Channel2                   ((GDMA_ChannelTypeDef      *) GDMA_Channel2_BASE)
#define GDMA_Channel3                   ((GDMA_ChannelTypeDef      *) GDMA_Channel3_BASE)
#define GDMA_Channel4                   ((GDMA_ChannelTypeDef      *) GDMA_Channel4_BASE)
#define GDMA_Channel5                   ((GDMA_ChannelTypeDef      *) GDMA_Channel5_BASE)
#define GDMA_Channel6                   ((GDMA_ChannelTypeDef      *) GDMA_Channel6_BASE)
#define GDMA_Channel7                   ((GDMA_ChannelTypeDef      *) GDMA_Channel7_BASE)
#define GDMA_Channel8                   ((GDMA_ChannelTypeDef      *) GDMA_Channel8_BASE)
#define GDMA_Channel9                   ((GDMA_ChannelTypeDef      *) GDMA_Channel9_BASE)
#define GDMA_Channel10                  ((GDMA_ChannelTypeDef      *) GDMA_Channel10_BASE)
#define GDMA_Channel11                  ((GDMA_ChannelTypeDef      *) GDMA_Channel11_BASE)
#define GDMA_Channel12                  ((GDMA_ChannelTypeDef      *) GDMA_Channel12_BASE)
#define GDMA_Channel13                  ((GDMA_ChannelTypeDef      *) GDMA_Channel13_BASE)
#define GDMA_Channel14                  ((GDMA_ChannelTypeDef      *) GDMA_Channel14_BASE)
#define GDMA_Channel15                  ((GDMA_ChannelTypeDef      *) GDMA_Channel15_BASE)

