wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl876x_gdma_def.h
#define IS_GDMA_PERIPH(PERIPH)     (((PERIPH) == GDMA_Channel0) || \
                                    ((PERIPH) == GDMA_Channel1) || \
                                    ((PERIPH) == GDMA_Channel2) || \
                                    ((PERIPH) == GDMA_Channel3) || \
                                    ((PERIPH) == GDMA_Channel4) || \
                                    ((PERIPH) == GDMA_Channel5) || \
                                    ((PERIPH) == GDMA_Channel6) || \
                                    ((PERIPH) == GDMA_Channel7) || \
                                    ((PERIPH) == GDMA_Channel8) || \
                                    ((PERIPH) == GDMA_Channel9) || \
                                    ((PERIPH) == GDMA_Channel10) || \
                                    ((PERIPH) == GDMA_Channel11) || \
                                    ((PERIPH) == GDMA_Channel12) || \
                                    ((PERIPH) == GDMA_Channel13) || \
                                    ((PERIPH) == GDMA_Channel14) || \
                                    ((PERIPH) == GDMA_Channel15))

#define IS_GDMA_ALL_PERIPH(PERIPH) (IS_GDMA_PERIPH(PERIPH))

/*============================================================================*
 *                         GDMA Registers and Field Descriptions
 *============================================================================*/
/* 0x00
   31:0    R/W    SAR                 undefined
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t SAR: 32;
    } b;
} GDMA_SARx_TypeDef;



/* 0x04
   31:0    R      CURR_SAR            0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        const uint32_t CURR_SAR: 32;
    } b;
} GDMA_CURR_SARx_TypeDef;



/* 0x08
31:0    R/W    DAR                 undefined
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t DAR: 32;
    } b;
} GDMA_DARx_TypeDef;



/* 0x0C
31:0    R      CURR_DAR            0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        const uint32_t CURR_DAR: 32;
    } b;
} GDMA_CURR_DARx_TypeDef;



/* 0x10
1:0     R/W    reserved13          0x0
31:2    R/W    LOC                 0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t reserved_0: 2;
        uint32_t LOC: 30;
    } b;
} GDMA_LLPx_TypeDef;


/* 0x18
0       R/W    INT_EN              0x1
3:1     R/W    DST_TR_WIDTH        0x0
6:4     R/W    SRC_TR_WIDTH        0x0
8:7     R/W    DINC                0x0
10:9    R/W    SINC                0x0
13:11   R/W    DEST_MSIZE          0x1
16:14   R/W    SRC_MSIZE           0x1
17      R/W    SRC_SCATTER_EN      0x0
18      R/W    DST_SCATTER_EN      0x0
19      R/W    reserved20          0x0
22:20   R/W    TT_FC               0x0
26:23   R      reserved18          0x0
27      R/W    LLP_DST_EN          0x0
28      R/W    LLP_SRC_EN          0x0
31:29   R      reserved15          0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t INT_EN: 1;
        uint32_t DST_TR_WIDTH: 3;
        uint32_t SRC_TR_WIDTH: 3;
        uint32_t DINC: 2;
        uint32_t SINC: 2;
        uint32_t DEST_MSIZE: 3;
        uint32_t SRC_MSIZE: 3;
        uint32_t SRC_GATHER_EN: 1;
        uint32_t DST_SCATTER_EN: 1;
        uint32_t reserved_2: 1;
        uint32_t TT_FC: 3;
        const uint32_t reserved_1: 4;
        uint32_t LLP_DST_EN: 1;
        uint32_t LLP_SRC_EN: 1;
        const uint32_t reserved_0: 3;
    } b;
} GDMA_CTL_LOWx_TypeDef;



/* 0x1C
31:0    R      TRANS_DATA_CNT      0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        const uint32_t TRANS_DATA_CNT: 32;
    } b;
} GDMA_CTL_HIGHx_R_TypeDef;



/* 0x1C
19:0    W      BLOCK_TS            0x2
31:20   W      reserved31          0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t BLOCK_TS: 20;
        uint32_t reserved_0: 12;
    } b;
} GDMA_CTL_HIGHx_W_TypeDef;


/* 0x40
0       R      INACTIVE            0x1
1       R      SRC_PCTL_OVER       0x1
2       R      DST_PCTL_OVER       0x1
3       R      reserved45          0x0
7:4     R/W    CH_PRIOR            0x0
8       R/W    CH_SUSP             0x0
9       R      FIFO_EMPTY          0x1
10      R/W    HS_SEL_DST          0x1
11      R/W    HS_SEL_SRC          0x1
17:12   R      reserved39          0x0
18      R/W    DST_HS_POL          0x0
19      R/W    SRC_HS_POL          0x0
29:20   R/W    reserved36          0x0
30      R/W    RELOAD_SRC          0x0
31      R/W    RELOAD_DST          0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        const uint32_t INACTIVE: 1;
        const uint32_t SRC_PCTL_OVER: 1;
        const uint32_t DST_PCTL_OVER: 1;
        const uint32_t reserved_2: 1;
        uint32_t CH_PRIOR: 4;
        uint32_t CH_SUSP: 1;
        const uint32_t FIFO_EMPTY: 1;
        uint32_t HS_SEL_DST: 1;
        uint32_t HS_SEL_SRC: 1;
        const uint32_t reserved_1: 6;
        uint32_t DST_HS_POL: 1;
        uint32_t SRC_HS_POL: 1;
        uint32_t reserved_0: 10;
        uint32_t RELOAD_SRC: 1;
        uint32_t RELOAD_DST: 1;
    } b;
} GDMA_CFG_LOWx_TypeDef;



/* 0x44
0       R/W    reserved63          0x0
1       R/W    reserved62          0x0
2       R      reserved61          0x0
3       R/W    PROTCTL             0x1
6:4     R      reserved59          0x0
10:7    R/W    SRC_PER             0x0
14:11   R/W    DEST_PER            0x0
15      R/W    ExtendedSRC_PER1    0x0
16      R/W    ExtendedDEST_PER1   0x0
17      R/W    ExtendedSRC_PER2    0x0
18      R/W    ExtendedDEST_PER2   0x0
19      R      ExtendedSRC_PER3    0x0
20      R      ExtendedDEST_PER3   0x0
31:21   R      reserved50          0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t reserved_5: 1;
        uint32_t reserved_4: 1;
        const uint32_t reserved_3: 1;
        uint32_t reserved_2: 1;
        const uint32_t reserved_1: 3;
        uint32_t SRC_PER: 4;
        uint32_t DEST_PER: 4;
        uint32_t ExtendedSRC_PER1: 1;
        uint32_t ExtendedDEST_PER1: 1;
        uint32_t ExtendedSRC_PER2: 1;
        uint32_t ExtendedDEST_PER2: 1;
        uint32_t ExtendedSRC_PER3: 1;
        uint32_t ExtendedDEST_PER3: 1;
        const uint32_t reserved_0: 11;
    } b;
} GDMA_CFG_HIGHx_TypeDef;

/* 0x48
19:0    R/W    SGI                 0x0
31:20   R/W    SGC                 0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t SGI: 20;
        uint32_t SGC: 12;
    } b;
} GDMA_SGR_LOW_TypeDef;

/* 0x4C
15:0    R/W    SGSN                0x0
31:16   R      reserved68          0x2
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t SGSN: 16;
        const uint32_t reserved_0: 16;
    } b;
} GDMA_SGR_HIGH_TypeDef;

