wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl876x_gdma_def.h
/* 0x50
19:0    R/W    DSI                 0x0
31:20   R      DSC                 0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t DSI: 20;
        uint32_t DSC: 12;
    } b;
} GDMA_DSR_LOW_TypeDef;

/* 0x54
15:0    R/W    DSSN                0x0
31:16   R      reserved74          0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t DSSN: 16;
        const uint32_t reserved_0: 16;
    } b;
} GDMA_DSR_HIGH_TypeDef;



/* 0x2E8
31:0    R      STATUS              0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        const uint32_t STATUS: 32;
    } b;
} GDMA_StatusTfr_TypeDef;



/* 0x2F0
31:0    R      STATUS              0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        const uint32_t STATUS: 32;
    } b;
} GDMA_StatusBlock_TypeDef;



/* 0x2F8
31:0    R      STATUS              0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        const uint32_t STATUS: 32;
    } b;
} GDMA_StatusSrcTran_TypeDef;



/* 0x300
31:0    R      STATUS              0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        const uint32_t STATUS: 32;
    } b;
} GDMA_StatusDstTran_TypeDef;



/* 0x308
31:0    R      STATUS              0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        const uint32_t STATUS: 32;
    } b;
} GDMA_StatusErr_TypeDef;



/* 0x310
7:0     R/W    INT_MASK_L          0x0
15:8    W      INT_MASK_WE_L       0x0
23:16   R/W    INT_MASK_H          0x0
31:24   W      INT_MASK_WE_H       0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t INT_MASK_L: 8;
        uint32_t INT_MASK_WE_L: 8;
        uint32_t INT_MASK_H: 8;
        uint32_t INT_MASK_WE_H: 8;
    } b;
} GDMA_MaskTfr_TypeDef;



/* 0x318
7:0     R/W    INT_MASK_L          0x0
15:8    W      INT_MASK_WE_L       0x0
23:16   R/W    INT_MASK_H          0x0
31:24   W      INT_MASK_WE_H       0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t INT_MASK_L: 8;
        uint32_t INT_MASK_WE_L: 8;
        uint32_t INT_MASK_H: 8;
        uint32_t INT_MASK_WE_H: 8;
    } b;
} GDMA_MaskBlock_TypeDef;



/* 0x320
7:0     R/W    INT_MASK_L          0x0
15:8    W      INT_MASK_WE_L       0x0
23:16   R/W    INT_MASK_H          0x0
31:24   W      INT_MASK_WE_H       0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t INT_MASK_L: 8;
        uint32_t INT_MASK_WE_L: 8;
        uint32_t INT_MASK_H: 8;
        uint32_t INT_MASK_WE_H: 8;
    } b;
} GDMA_MaskSrcTran_TypeDef;



/* 0x328
7:0     R/W    INT_MASK_L          0x0
15:8    W      INT_MASK_WE_L       0x0
23:16   R/W    INT_MASK_H          0x0
31:24   W      INT_MASK_WE_H       0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t INT_MASK_L: 8;
        uint32_t INT_MASK_WE_L: 8;
        uint32_t INT_MASK_H: 8;
        uint32_t INT_MASK_WE_H: 8;
    } b;
} GDMA_MaskDstTran_TypeDef;



/* 0x330
7:0     R/W    INT_MASK_L          0x0
15:8    W      INT_MASK_WE_L       0x0
23:16   R/W    INT_MASK_H          0x0
31:24   W      INT_MASK_WE_H       0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t INT_MASK_L: 8;
        uint32_t INT_MASK_WE_L: 8;
        uint32_t INT_MASK_H: 8;
        uint32_t INT_MASK_WE_H: 8;
    } b;
} GDMA_MaskErr_TypeDef;



/* 0x338
31:0    W      CLEAR               0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t CLEAR: 32;
    } b;
} GDMA_ClearTfr_TypeDef;



/* 0x340
31:0    W      CLEAR               0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t CLEAR: 32;
    } b;
} GDMA_ClearBlock_TypeDef;



/* 0x348
31:0    W      CLEAR               0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t CLEAR: 32;
    } b;
} GDMA_ClearSrcTran_TypeDef;



/* 0x350
31:0    W      CLEAR               0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t CLEAR: 32;
    } b;
} GDMA_ClearDstTran_TypeDef;



/* 0x358
31:0    W      CLEAR               0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t CLEAR: 32;
    } b;
} GDMA_ClearErr_TypeDef;



/* 0x398
0       R/W    DMAC_EN             0x0
31:1    R      reserved130         0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t DMAC_EN: 1;
        __I uint32_t reserved_0: 31;
    } b;
} GDMA_DmaCfgReg_TypeDef;



/* 0x3A0
7:0     R/W    CH_EN_L             0x0
15:8    W      CH_EN_WE_L          0x0
23:16   R/W    CH_EN_H             0x0
31:24   W      CH_EN_WE_H          0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        uint32_t CH_EN_L: 8;
        uint32_t CH_EN_WE_L: 8;
        uint32_t CH_EN_H: 8;
        uint32_t CH_EN_WE_H: 8;
    } b;
} GDMA_ChEnReg_TypeDef;



/* 0x3B8
4:0     R    OSR                 0xC
7:5     R    reserved_0          0x0
10:8    R    OSW                 0x4
31:11   R    reserved_1          0x0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        const uint32_t OSR: 5;
        const uint32_t reserved_0: 3;
        const uint32_t OSW: 3;
        const uint32_t reserved_1: 21;
    } b;
} GDMA_DmaOsNum_TypeDef;


/* ================================================================================ */
/* ================                   GDMA  Constants              ================ */
/* ================================================================================ */

/**
 * \brief    GDMA Channe Type Re_define
 *
 * \ingroup  GDMA_Exported_Constants
 */

#define GDMA_Channel0_IRQn              GDMA0_Channel0_IRQn
#define GDMA_Channel1_IRQn              GDMA0_Channel1_IRQn
#define GDMA_Channel2_IRQn              GDMA0_Channel2_IRQn
#define GDMA_Channel3_IRQn              GDMA0_Channel3_IRQn
#define GDMA_Channel4_IRQn              GDMA0_Channel4_IRQn
#define GDMA_Channel5_IRQn              GDMA0_Channel5_IRQn
#define GDMA_Channel6_IRQn              GDMA0_Channel6_IRQn
#define GDMA_Channel7_IRQn              GDMA0_Channel7_IRQn
#define GDMA_Channel8_IRQn              GDMA0_Channel8_IRQn
#define GDMA_Channel9_IRQn              GDMA0_Channel9_IRQn
#define GDMA_Channel10_IRQn             GDMA0_Channel10_IRQn
#define GDMA_Channel11_IRQn             GDMA0_Channel11_IRQn

#define GDMA_Channel0_Handler           GDMA0_Channel0_Handler
#define GDMA_Channel1_Handler           GDMA0_Channel1_Handler
#define GDMA_Channel2_Handler           GDMA0_Channel2_Handler
#define GDMA_Channel3_Handler           GDMA0_Channel3_Handler
#define GDMA_Channel4_Handler           GDMA0_Channel4_Handler
#define GDMA_Channel5_Handler           GDMA0_Channel5_Handler
#define GDMA_Channel6_Handler           GDMA0_Channel6_Handler
#define GDMA_Channel7_Handler           GDMA0_Channel7_Handler
#define GDMA_Channel8_Handler           GDMA0_Channel8_Handler
#define GDMA_Channel9_Handler           GDMA0_Channel9_Handler
#define GDMA_Channel10_Handler          GDMA0_Channel10_Handler
#define GDMA_Channel11_Handler          GDMA0_Channel11_Handler

/**
  * \defgroup    GDMA_Handshake GDMA Handshake
  * \{
  * \ingroup     GDMA_Exported_Constants
  */


/* GDMA Handshake index for DESCRIPTION (BB2ULTRA) */
#define GDMA_Handshake_UART0_TX                                     (0)
#define GDMA_Handshake_UART0_RX                                     (1)
#define GDMA_Handshake_UART2_TX                                     (2)
#define GDMA_Handshake_UART2_RX                                     (3)
#define GDMA_Handshake_SPI0_TX                                      (4)
#define GDMA_Handshake_SPI0_RX                                      (5)
#define GDMA_Handshake_SPI1_TX                                      (6)
#define GDMA_Handshake_SPI1_RX                                      (7)
#define GDMA_Handshake_I2C0_TX                                      (8)
#define GDMA_Handshake_I2C0_RX                                      (9)
#define GDMA_Handshake_I2C1_TX                                      (10)
#define GDMA_Handshake_I2C1_RX                                      (11)
#define GDMA_Handshake_ADC_RX                                       (12)
#define GDMA_Handshake_AES_TX                                       (13)
#define GDMA_Handshake_AES_RX                                       (14)
#define GDMA_Handshake_UART1_TX                                     (15)
#define GDMA_Handshake_TDM_0_TX                                     (16)
#define GDMA_Handshake_TDM_0_RX                                     (17)
#define GDMA_Handshake_TDM_1_TX                                     (18)
#define GDMA_Handshake_TDM_1_RX                                     (19)
#define GDMA_Handshake_UART1_RX                                     (20)
#define GDMA_Handshake_SPIC0_TX                                     (21)
#define GDMA_Handshake_SPIC0_RX                                     (22)
#define GDMA_Handshake_CANBUS0_RX                                   (23)
#define GDMA_Handshake_CANBUS2_RX                                   (24)
#define GDMA_Handshake_TIM1_CH6_TRX                                 (25)
#define GDMA_Handshake_TIM1_CH4                                     (26)
#define GDMA_Handshake_TIM1_CH5                                     (27)
#define GDMA_Handshake_TIM1_CH6                                     (28)
#define GDMA_Handshake_TIM1_CH7                                     (29)
#define GDMA_Handshake_TIM1_CH8                                     (30)
#define GDMA_Handshake_TIM1_CH9                                     (31)
#define GDMA_Handshake_SPIC1_TX                                     (32)
#define GDMA_Handshake_SPIC1_RX                                     (33)
#define GDMA_Handshake_SPIC2_TX                                     (34)
#define GDMA_Handshake_SPIC2_RX                                     (35)
#define GDMA_Handshake_I2C2_TX                                      (36)
#define GDMA_Handshake_I2C2_RX                                      (37)
#define GDMA_Handshake_SPI2_TX                                      (38)
#define GDMA_Handshake_SPI2_RX                                      (39)
#define GDMA_Handshake_AUDIO_RX                                     (40)
#define GDMA_Handshake_TDM_2_RX                                     (42)
#define GDMA_Handshake_IDU_RX                                       (43)
#define GDMA_Handshake_IDU_TX                                       (44)
#define GDMA_Handshake_SM3                                          (46)
#define GDMA_Handshake_UART3_TX                                     (48)
#define GDMA_Handshake_UART3_RX                                     (49)
#define GDMA_Handshake_UART4_TX                                     (50)
#define GDMA_Handshake_UART4_RX                                     (51)
#define GDMA_Handshake_UART5_TX                                     (52)
#define GDMA_Handshake_UART5_RX                                     (53)
#define GDMA_Handshake_TIM1_CH7_TRX                                 (54)
#define GDMA_Handshake_SPI_SLAVE_TX                                 (55)
#define GDMA_Handshake_SPI_SLAVE_RX                                 (56)
#define GDMA_Handshake_CANBUS1_RX                                   (57)
#define GDMA_Handshake_TIM1_CH9_TRX                                 (58)
#define GDMA_Handshake_TIM1_CH8_TRX                                 (59)
#define GDMA_Handshake_SPIC3_TX                                     (60)
#define GDMA_Handshake_SPIC3_RX                                     (61)
#define GDMA_Handshake_IR_TX                                        (62)
#define GDMA_Handshake_IR_RX                                        (63)

// for compatible with BBPRO
#define GDMA_Handshake_UART_TX           GDMA_Handshake_UART0_TX
#define GDMA_Handshake_UART_RX           GDMA_Handshake_UART0_RX
#define GDMA_Handshake_LOG_UART1_TX      GDMA_Handshake_UART2_TX
#define GDMA_Handshake_LOG_UART1_RX      GDMA_Handshake_UART2_RX
#define GDMA_Handshake_LOG_UART_TX       GDMA_Handshake_UART1_TX
#define GDMA_Handshake_LOG_UART_RX       GDMA_Handshake_UART1_RX

#define IS_GDMA_TransferType(Type) (((Type) == GDMA_Handshake_UART0_TX) || \
                                    ((Type) == GDMA_Handshake_UART0_RX) || \
                                    ((Type) == GDMA_Handshake_UART2_TX) || \
                                    ((Type) == GDMA_Handshake_UART2_RX) || \
                                    ((Type) == GDMA_Handshake_SPI0_TX) || \
                                    ((Type) == GDMA_Handshake_SPI0_RX) || \
                                    ((Type) == GDMA_Handshake_SPI1_TX) || \
                                    ((Type) == GDMA_Handshake_SPI1_RX) || \
                                    ((Type) == GDMA_Handshake_I2C0_TX) || \
                                    ((Type) == GDMA_Handshake_I2C0_RX) || \
                                    ((Type) == GDMA_Handshake_I2C1_TX) || \
                                    ((Type) == GDMA_Handshake_I2C1_RX) || \
                                    ((Type) == GDMA_Handshake_ADC_RX) || \
                                    ((Type) == GDMA_Handshake_AES_TX) || \
                                    ((Type) == GDMA_Handshake_AES_RX) || \
                                    ((Type) == GDMA_Handshake_UART1_TX) || \
                                    ((Type) == GDMA_Handshake_TDM_0_TX) || \
                                    ((Type) == GDMA_Handshake_TDM_0_RX) || \
                                    ((Type) == GDMA_Handshake_TDM_1_TX) || \
                                    ((Type) == GDMA_Handshake_TDM_1_RX) || \
                                    ((Type) == GDMA_Handshake_UART1_RX) || \
                                    ((Type) == GDMA_Handshake_SPIC0_TX) ||\
                                    ((Type) == GDMA_Handshake_SPIC0_RX) ||\
                                    ((Type) == GDMA_Handshake_CANBUS0_RX) ||\
                                    ((Type) == GDMA_Handshake_TIM1_CH4)||\
                                    ((Type) == GDMA_Handshake_TIM1_CH5)||\
                                    ((Type) == GDMA_Handshake_TIM1_CH6)||\
                                    ((Type) == GDMA_Handshake_TIM1_CH7)||\
                                    ((Type) == GDMA_Handshake_TIM1_CH8)||\
                                    ((Type) == GDMA_Handshake_TIM1_CH9)||\
                                    ((Type) == GDMA_Handshake_SPIC1_TX)||\
                                    ((Type) == GDMA_Handshake_SPIC1_RX)||\
                                    ((Type) == GDMA_Handshake_SPIC2_TX)||\
                                    ((Type) == GDMA_Handshake_SPIC2_RX)||\
                                    ((Type) == GDMA_Handshake_I2C2_TX)||\
                                    ((Type) == GDMA_Handshake_I2C2_RX)||\
                                    ((Type) == GDMA_Handshake_SPI2_TX)||\
                                    ((Type) == GDMA_Handshake_SPI2_RX)||\
                                    ((Type) == GDMA_Handshake_AUDIO_RX)||\
                                    ((Type) == GDMA_Handshake_TDM_2_RX)||\
                                    ((Type) == GDMA_Handshake_IDU_RX)||\
                                    ((Type) == GDMA_Handshake_IDU_TX)||\
                                    ((Type) == GDMA_Handshake_SM3)||\
                                    ((Type) == GDMA_Handshake_UART3_TX)||\
                                    ((Type) == GDMA_Handshake_UART3_RX)||\
                                    ((Type) == GDMA_Handshake_UART4_TX)||\
                                    ((Type) == GDMA_Handshake_UART4_RX)||\
                                    ((Type) == GDMA_Handshake_UART5_TX)||\
                                    ((Type) == GDMA_Handshake_UART5_RX)||\
                                    ((Type) == GDMA_Handshake_SPI_SLAVE_TX)||\
                                    ((Type) == GDMA_Handshake_SPI_SLAVE_RX)||\
                                    ((Type) == GDMA_Handshake_CANBUS1_RX)||\
                                    ((Type) == GDMA_Handshake_TIM1_CH6_TRX)||\
                                    ((Type) == GDMA_Handshake_IR_TX)||\
                                    ((Type) == GDMA_Handshake_IR_RX)||\
                                    ((Type) == GDMA_Handshake_CANBUS2_RX)||\
                                    ((Type) == GDMA_Handshake_SPIC3_TX)||\
                                    ((Type) == GDMA_Handshake_SPIC3_RX)||\
                                    ((Type) == GDMA_Handshake_TIM1_CH7_TRX)||\
                                    ((Type) == GDMA_Handshake_TIM1_CH8_TRX)||\
                                    ((Type) == GDMA_Handshake_TIM1_CH9_TRX)||\
                                   )


/** End of GDMA_Handshake
  * \}
  */


/**
 * \brief    GDMA Macro Wrapper
 *
 * \ingroup  GDMA_Exported_Constants
 */
#define GDMA_Source_Cir_Gather_Num  GDMA_GatherCircularStreamingNum
#define GDMA_Dest_Cir_Sca_Num       GDMA_ScatterCircularStreamingNum

#ifdef  __cplusplus
}
#endif /* __cplusplus */
#endif /* RTL_GDMA_DEF_H */

